/* */

/* Explicit concatenation: */
say "Now is the winter " || "of our discontent"

/* Abuttal concatenation: */
say "Made glorious "Summer()

/* Blank concatenation: */
say "By this sun" "of York"

exit

Summer: procedure
return "summer"
